# Указывает базовый(родительский) образ, на основе которого будет строиться наш образ
FROM node
# Задачем рабочую дирректорию
WORKDIR /app
# Копируем в контейнер файлы и папки. Сначала указывает откуда,
# а затем куда мы будем их копировать. Сейчас мы находимся в контексте папки app
COPY . .
# Запускаем npm install для загрузки пакетов. RUN запускается, когда мы собираем сам образ
RUN npm install
# Открываем порт 5000
EXPOSE 5000
# CMD запускается каждый раз, когда мы запускаем образ
CMD [ "node", "index.js" ]

# Далее создаем образ командой docker build .
# docker images - посмотреть образы
# docker run -p 5000:5000 <imageId> - запустить контейнер на основе образа, -p - открывает порты
# docker start <containerId> - запустить контейнер

# Еще список базовых команд Dockerfile
# LABEL — описывает метаданные. Например — сведения о том, кто создал и поддерживает образ.
# ENV — устанавливает постоянные переменные среды.
# ADD — копирует файлы и папки в контейнер, может распаковывать локальные .tar-файлы.
# ARG — задаёт переменные для передачи Docker во время сборки образа.
# ENTRYPOINT — предоставляет команду с аргументами для вызова во время выполнения контейнера. Аргументы не переопределяются.
# VOLUME — создаёт точку монтирования для работы с постоянным хранилищем.